"""
Написать функцию, которая создает массив из всех четных элементов между 50 и 90.
"""

import numpy
print("Массив четных элементов между 50 и 90:")
print(numpy.arange(50,91,2)) #Первые два параметра - начальное и конечное значение, третий - шаг
